Others/o/procmail.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>Procmail邮件过滤</title>
<!-- 2013-05-17 五 17:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title">Procmail邮件过滤</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Flag 种类：</a></li>
<li><a href="#sec-2">2. 条件:</a></li>
<li><a href="#sec-3">3. 处理方式：</a></li>
<li><a href="#sec-4">4. 预设的环境变量：</a></li>
<li><a href="#sec-5">5. procmail的正规表示式：</a></li>
<li><a href="#sec-6">6. 例子</a></li>
<li><a href="#sec-7">7. trick</a>
<ul>
<li><a href="#sec-7-1">7.1. 用formail获取主题/来信人</a></li>
</ul>
</li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/style.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>
<p>
<a href="http://wanwentao.blog.51cto.com/2406488/435852">http://wanwentao.blog.51cto.com/2406488/435852</a><br/>
</p>

<p>
:0 [flags] [ : [locallockfile] ]<br/>
&lt;zero or more conditions (one per line)&gt; 判别条件<br/>
&lt;exactly one action line&gt; 符合前项的处理方式<br/>
</p>

<p>
条件以 * 开始，表示除了开头与最后的空白，之后的字符皆会逐字导向 egrep。<br/>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Flag 种类：</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
H 以 egrep 搜寻 mail header (预设)
B 以 egrep 搜寻 mail body
D 指定 egrep 区分英文字母的大小写 (预设不区分大小写)
A 除非前项最后条件 (或是同层的巢状条件) 未符合 “A” 或是 “a” flag，否则这个flag 不会被执行。
a 与 A flag 相同，不过前一条件必须执行并且成功。
E 这个 flag 只有在前面的 flag 没有被执行的状况下才会执行。使用 E flag 时，完成这个 flag 的判别条件之后，不会执行之后的 flag，类似 else if 效果。
e 这个 flag 只有在目前 flag 执行失败的状况下才会执行 (例如：试着执行某行，但是结果是错误 error)
h 传送 mail header 给予 导管 (pipe, |), 档案 (file) 或是邮件递送目的地 (预设)
b 传送 mail body 透过 导管(pipe, |), 档案 (file) 或是邮件递送目的地 (预设)
f 指定导管 (pipe, |) 为 Filter (过滤项目)。
c 复制此邮件，这个复制动作。
w 这个 flag 会等待 filter 或是程序结束并检查程序的结束状态码 (通常是 ignored)，如果 filter 程序失败，结束状态将不会是 filtered。
W 和 w flag 相同，不过会隐藏 “Program failure” 讯息。
i 略过在这个 flag 的所有写入错误 (通常是pipe 被提前中断)
r 原始模式，不会于邮件的结尾部分加上空行，保持原状。
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 条件:</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
! 条件反意，如果原本条件为“等于A 就删除“，将变为
不等于A 就删除“。
$ 用sh 把双引号间的规则进行改写
? 传递执行后的状态码予指定的程序
&lt; 若邮件大小小于(byte)
&gt; 若邮件大小大于(byte)
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 处理方式：</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
! 转送信件到特定e-mail address
| 把信件导往其它程序处理，例如
| /usr/bin/spamc 代表把邮件转给 spamc 处理。
{ } 巢状，可再接另外的过滤条件。
/dev/null 删除
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 预设的环境变量：</h2>
<div class="outline-text-2" id="text-4">
<p>
ORGMAIL=/var/spool/mail/$LOGNAME (本机收件者信箱档案)<br/>
DEFAULT=$ORGMAIL<br/>
MAILDIR=$HOME/ (使用者的 e-Mail 目录)<br/>
HOST=主机的hostname<br/>
LOCKEXT=.lock<br/>
MSGPREFIX=msg.<br/>
SENDMAIL=/usr/sbin/sendmail<br/>
SENDMAILFLAGS=-oi<br/>
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> procmail的正规表示式：</h2>
<div class="outline-text-2" id="text-5">
<p>
^ 该行开头<br/>
$ 该行结尾<br/>
. 表示任意字符 (除了换行字符)<br/>
a* 以a为起始第一个字母的句子<br/>
a? a加上任意字符或者是只有a<br/>
[^-a-d] 除了 换行、-、a、b、c、d 以外的所有字符<br/>
. 代表文字 .<br/>
&lt; 代表文字 &lt;<br/>
&gt; 代表文字<br/>
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 例子</h2>
<div class="outline-text-2" id="text-6">
<pre class="example">
将所有来自peter标题含有computer的信转发给william  
同时在本地留一个保存一个备份在文件petcomp中  
:0  
* ^From:.*peter  
* ^Subject:.*computer  
{  
:0 c  
! william@somewhere.edu  

:0  
petcomp  
}  

这个也等价于  
:0 c  
* ^From:.*peter  
* ^Subject:.*computer  
! william@somewhere.edu  

:0 A  
petcomp  
</pre>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> trick</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 用formail获取主题/来信人</h3>
<div class="outline-text-3" id="text-7-1">
<pre class="example">
cat 信件| formail -zfxFrom   
cat 信件| formail -zfxSubject
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
